{"keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "trainable": true, "activation": "linear", "batch_input_shape": [null, 218, 163, 1], "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "dtype": "float32", "data_format": "channels_last", "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "relu", "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "relu", "name": "conv2d_3", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "filters": 128}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "relu", "name": "conv2d_4", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "filters": 128}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "relu", "name": "conv2d_5", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "filters": 128}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_5", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.2, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 256, "trainable": true, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_2", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 3, "trainable": true, "kernel_constraint": null}}], "backend": "tensorflow"}